package controllers

/**
 * @author SAW
 */
object ResponseCode {

  // ===================================================================================
  //                                                                             Success
  //                                                                             =======

  val NoReason                              = (20000, "OK")

  // ===================================================================================
  //                                                                         Bad Request
  //                                                                         ===========

  val ValidationError                       = (40000, "入力した値に異常があります")

  val PasswordsNotMatch                     = (40001, "パスワードが一致しません")

  def MailIsUsed(mail: String)              = (40002, s"メールアドレス['$mail']はすでに利用されています")

  val HashValuesNotMatch                    = (40003, "確認できませんでした")

  val SignInFailed                          = (40004, "サインインに失敗しました。メールアドレスとパスワードを確認してください")

  val NotConfirmed                          = (40005, "サインインに失敗しました。確認メールが承認されていません")

  val TweetIsNotYours                       = (40006, "自分のツイートではありません")

  val TweetDeleted                          = (40007, "ツイートはすでに削除されています")

  val TweetIsMine                           = (40008, "自分のツイートは評価できません")

  val AlreadyValued                         = (40009, "すでに評価済みです")

  // ===================================================================================
  //                                                                        UnAuthorized
  //                                                                        ============

  val NeedSignIn                            = (40100, "この操作はサインインしている必要があります")

  // ===================================================================================
  //                                                                           Not Found
  //                                                                           =========

  val MemberNotFound                        = (40400, "ユーザが見つかりませんでした")

  val TweetNotFound                         = (40401, "ツイートが見つかりませんでした")

  val HashNotFound                          = (40402, "ユーザが確認できませんでした")
}
